function ニュース差分(){

アイテム関数();

転落=[
`困っているようだった`,
`意外と元気そうだった`,
]
転落乱数=Math.floor(Math.random() * 転落.length);


落とし物=[
`うちの家宝なので助かった`,
`何時間も探した。見つかってよかった`,
]
落とし物乱数=Math.floor(Math.random() * 落とし物.length);

漂着=[
`どうせならお金が流れてくればよかったのに`,
`たくさん拾って売ろうと思う`,
]
漂着乱数=Math.floor(Math.random() * 漂着.length);

えんぴつ=[
`必死な顔をしていたので、仕方なく交換してあげた`,
`おかしなことをする人もいるもんだ`,
]
えんぴつ乱数=Math.floor(Math.random() * えんぴつ.length);

予知=[
`目の前の人がこけること`,
`１０円をひろうこと`,
`カサがこわれること`,
`口内炎になること`,
`鳥のフンが落ちてくること`,
]
予知乱数=Math.floor(Math.random() * 予知.length);

できた=[
`逆上がり`,
`口笛`,
`ウインク`,
`そばを音を立てて吸う事`,
`ロボットダンス`,
]
できた乱数=Math.floor(Math.random() * できた.length);

間一髪=[
`無我夢中で、よく憶えていない`,
`無事助けられて良かった`,
`気をつけて運転をして欲しい`,
]
間一髪乱数=Math.floor(Math.random() * 間一髪.length);


衝突=[
`${お宝}`,
`${お宝2}`,
]
衝突乱数=Math.floor(Math.random() * 衝突.length);

水中=[
`１０秒しか息が続かず`,
`思い出し笑いをし`,
`自分のこの姿が情けなくなり`,
`寒さでトイレに行きたくなり`,
]
水中乱数=Math.floor(Math.random() * 水中.length);

バイク=[
`思った以上にバイクが重くて`,
`まず、基本姿勢を維持できず`,
`上に乗ったままバイクがエンストを起こし`,
`バイクが来る前に怖気づき`,
]
バイク乱数=Math.floor(Math.random() * バイク.length);

おなら=[
`あまりの臭さに自分が気絶して`,
`あまりのおならの勢いにパンツが破け`,
`緊張して1回もおならを出せず`,
`周囲の目が急に恥ずかしくなって`,
]
おなら乱数=Math.floor(Math.random() * おなら.length);

異臭=[
`しばらく、お風呂に入っていなかった`,
`冷蔵庫の中の物が腐っていた`,
`料理に何か混ぜたらとても臭いものになった`,
]
異臭乱数=Math.floor(Math.random() * 異臭.length);

宝くじ=[
`当たった人が羨ましい`,
`１００枚も買ったのに、当たらなかった`,
`運がなかっただけ、残念です`,
`次もがんばりますよ！当たるまで買います`,
`え？うそっ！当たってる！！`,
]
宝くじ乱数=Math.floor(Math.random() * 宝くじ.length);

騒音=[
`鼻に洗濯バサミを付けて寝て`,
`鼻に栓を詰めて欲しい`,
`顔を囲って欲しい`,
]
騒音乱数=Math.floor(Math.random() * 騒音.length);

行列=[
`みんなが並んでるので並んだ`,
`２０個は買うつもり`,
`品切れにならないか心配`,
]
行列乱数=Math.floor(Math.random() * 行列.length);

空き部屋=[
`最近電気代高いわ～`,
`トイレの水が流れない！`,
`ちょっとタオル取って～`,
`もやしが余っちゃったわ。どうしましょう`,
`ちょっとティッシュ買ってきてー`,
]
空き部屋乱数=Math.floor(Math.random() * 空き部屋.length);

カフェ=[
`さわり心地がとてもいい`,
`何時間いても飽きない`,
]
カフェ乱数=Math.floor(Math.random() * カフェ.length);



やせる=[
`これを持ち始めて、体重が１００ｇ減った`,
`あと５０個持てばやせられるかもしれない`,
`べ、別にやせたくて持ってるわけじゃないですから`,
]
やせる乱数=Math.floor(Math.random() * やせる.length);


ライブ=[
`水虫`,
`便秘`,
`ぎっくり腰`,
]
ライブ乱数=Math.floor(Math.random() * ライブ.length);


ガラス=[
`まさかこんな風に作るとは`,
`随分そっくりにできた`,
`もっと何か作りたくなった`,
`とてもいい経験になった`,
]
ガラス乱数=Math.floor(Math.random() * ガラス.length);

}