function ニュース差分(){

動物=[
`顔がかわいい`,
`変な顔でおもしろい`
]
動物乱数=Math.floor(Math.random() * 動物.length);

MVP=[
`すばらしいダンスを踊ったから`,
`部屋がとてもカッコよかったから`,
`ファッションがスバラシかったから`,
]
MVP乱数=Math.floor(Math.random() * MVP.length);

里山=[
`落ち葉を踏みしめる感触が気持ちいい`,
`とても疲れた`,
]
里山乱数=Math.floor(Math.random() * 里山.length);

鳥=[
`奥の鳥が友達に似ている`,
`鯉にあげるつもりだった`,
]
鳥乱数=Math.floor(Math.random() * 鳥.length);

漂着=[
`どうせならお金が流れてくればよかったのに`,
`たくさん拾って売ろうと思う`,
]
漂着乱数=Math.floor(Math.random() * 漂着.length);

予知=[
`目の前の人がこけること`,
`１０円をひろうこと`,
`１０円をひろうこと`,
`口内炎になること`,
`鳥のフンが落ちてくること`,
]
予知乱数=Math.floor(Math.random() * 予知.length);

行列=[
`みんなが並んでるので並んだ`,
`２０個は買うつもり`,
`品切れにならないか心配`,
]
行列乱数=Math.floor(Math.random() * 行列.length);

空き部屋=[
`最近電気代高いわ～`,
`トイレの水が流れない！`,
`ちょっとタオル取って～`,
`もやしが余っちゃったわ。どうしましょう`,
`ちょっとティッシュ買ってきてー`,
]
空き部屋乱数=Math.floor(Math.random() * 空き部屋.length);

カフェ=[
`さわり心地がとてもいい`,
`何時間いても飽きない`,
]
カフェ乱数=Math.floor(Math.random() * カフェ.length);

立てこもり=[
`歯医者に行きたくなかった。`,
`髪を切りすぎたので、外に出たくなかった`,
`録画していたドラマを一気に見たかったので、部屋から出たくなかった`,
]
立てこもり乱数=Math.floor(Math.random() * 立てこもり.length);

できた=[
`逆上がり`,
`口笛`,
`ウインク`,
`そばを音を立てて吸う事`,
`ロボットダンス`,
]
できた乱数=Math.floor(Math.random() * できた.length);

やせる=[
`これを持ち始めて、体重が１００ｇ減った`,
`あと５０個持てばやせられるかもしれない`,
`べ、別にやせたくて持ってるわけじゃないですから`,
]
やせる乱数=Math.floor(Math.random() * やせる.length);

バイク=[
`思った以上にバイクが重くて`,
`まず、基本姿勢を維持できず`,
`上に乗ったまま、バイクがエンストを起こし`,
`バイクが来る前に怖気づき`,
]
バイク乱数=Math.floor(Math.random() * バイク.length);

おなら=[
`あまりの臭さに自分が気絶して`,
`あまりのおならの勢いにパンツが破け`,
`緊張して1回もおならを出せず`,
`周囲の目が急に恥ずかしくなって`,
]
おなら乱数=Math.floor(Math.random() * おなら.length);

節水=[
`毎日、お風呂の水を洗濯に使っている`,
`いつも栓がきちんと閉まっているかちゃんと確かめている`,
`食器を洗う時は毎回きちんと水を止めている`,
]
節水乱数=Math.floor(Math.random() * 節水.length);

エッセイ=[
`人生ひなたぼっこ`,
`急がば回れ`,
`オーガニックとは何か`,
`立ち止まれば青空`,
]
エッセイ乱数=Math.floor(Math.random() * エッセイ.length);

転落=[
`困っているようだった`,
`とにかく驚いた`,
`意外と元気そうだった`
]
転落乱数=Math.floor(Math.random() * 転落.length);

落とし物=[
`うちの家宝なので助かった`,
`何時間も探した。見つかってよかった`
]
落とし物乱数=Math.floor(Math.random() * 落とし物.length);

えんぴつ=[
`必死な顔をしていたので、仕方なく換してあげた`,
`おかしなことをする人もいるもんだ`
]
えんぴつ乱数=Math.floor(Math.random() * えんぴつ.length);

間一髪=[
`無事助けられて良かった`,
`気をつけて運転をして欲しい`
]
間一髪乱数=Math.floor(Math.random() * 間一髪.length);

衝突=[
`${お宝[お宝乱数]}`,
`${お宝[お宝乱数2]}`
]
衝突乱数=Math.floor(Math.random() * 衝突.length);

大声=[
`腹へったーー！！！`,
`昔に戻りたいーー！！！`,
`２回も同じところでこけたーー！！！`,
`マイクのテスト中ーー！！！`,
`ホッヤーー！！！`
]
大声乱数=Math.floor(Math.random() * 大声.length);

水中=[
`鼻から思いっきり水が入り`,
`１０秒しか息が続かず`,
`思い出し笑いをし`,
`自分のこの姿が情けなくなり`,
`寒さでトイレに行きたくなり`
]
水中乱数=Math.floor(Math.random() * 水中.length);

ライブ=[
`水虫`,
`便秘`,
`ぎっくり腰`
]
ライブ乱数=Math.floor(Math.random() * ライブ.length);

異臭=[
`しばらく、お風呂に入っていなかった`,
`冷蔵庫の中の物が腐っていた`,
`料理に何か混ぜたらとても臭いものになった`
]
異臭乱数=Math.floor(Math.random() * 異臭.length);

人面犬=[
`人面犬を見たのは初めてで`,
`顔が知り合いに似ていて`,
]
人面犬乱数=Math.floor(Math.random() * 人面犬.length);

ネタ=[
`もう、今回限りにしてほしい`,
`寒すぎて見てるのがつらかった`,
]
ネタ乱数=Math.floor(Math.random() * ネタ.length);

ダイバー=[
`魚を間近で見たのは初めてだった`,
`溺れてしまうかも、とドキドキした`,
]
ダイバー乱数=Math.floor(Math.random() * ダイバー.length);

宝くじ=[
`当たった人が羨ましい`,
`１００枚も買ったのに、当たらなかった`,
`運がなかっただけ、残念です`,
`次もがんばりますよ！当たるまで買います`,
`え？うそっ！当たってる！！`,
]
宝くじ乱数=Math.floor(Math.random() * 宝くじ.length);

騒音=[
`鼻に洗濯バサミを付けて寝て`,
`鼻に栓を詰めて欲しい`,
`顔を囲って欲しい`,
]
騒音乱数=Math.floor(Math.random() * 騒音.length);

ガラス=[
`まさかこんな風に作るとは`,
`随分そっくりにできた`,
`もっと何か作りたくなった`,
`とてもいい経験になった`,
]
ガラス乱数=Math.floor(Math.random() * ガラス.length);

}