function city(){
住居=[
`東京クオリティハウス`,
`デザイナーズハウス`,
`ガラス張りの家`,
`ケビンウェイ邸宅`,
`香港式アパート`,
`日本式アパート`,
`ヤマモモ屋敷`,
`香港式デコマナー`,
`中流式マンション`,
`ニューヨークパレス`,
`高級分譲マンション`,
`赤青マンション`,
`ベッドタウン団地`,
`年代物集合型団地`,
`ツインマンション`,
`超高級マンション`,
`高層マンション`,
`イタリアンマンション`,
]
住居乱数=Math.floor(Math.random() * 住居.length);

商業=[
`街角の文具屋`,
`仕立屋さん`,
`スタンド型商店`,
`おしゃれな洋菓子店`,
`ガソリンスタンド`,
`六角ビル`,
`ファッションビル`,
`高級ブティック`,
`高級雑貨店`,
`角の肉屋`,
`テッドタイヤ店`,
`食料品店`,
`ショッピングビル`,
`貴重品店`,
`ブランドビル`,
]
商業乱数=Math.floor(Math.random() * 商業.length);
}