function main(){
数字();
その他関数();
人物関数();
日本関数();
食べ物関数();
アイテム関数();
ニュース差分();

ニュース本文=[
//`【】`,
`${ペア1}さんがわらしべ長者に挑戦し、えんぴつが${お宝}になりました。${お宝}を交換した${ペア2}さん「${えんぴつ}」`,
`先日行われた作文コンクールの受賞作品が、${男性}さんの書いた「${女性}と${お宝}」に決定しました。`,
`このところ話題になっている${食べ物}の人気は衰えず、今日も${食べ物}を売る店の前には長蛇の列が出来ています。${食べ物}を買いに来た${人物}さん「${行列}」`,
`${地名}の某マンションには、空き部屋から声が聞こえるという噂があります。住民の${人物}さん「『${空き部屋}』という声を確かに聞いた」`,
`${自治体}にある温泉の脱衣所で、パンツの忘れ物が発見されました。利用者によると、「あの柄からして${人物}さんのパンツでは？」とのことです。`,
`${人物}さんが、${飲み物}の入った水槽の中で${食べ物}を逆さになって食べるというチャレンジに挑戦しました。しかし、${水中}、あえなく失敗しました。`,
`${人物}さんが、鼻の穴に${お宝}をいくつ入れられるかというチャレンジに挑戦しました。しかし、鼻がつまっていて入らなかった為、あえなく失敗しました。`,
`${人物}さんが、自分が橋になってバイクを無事に渡らせる事ができるかというチャレンジに挑戦しました。しかし、${バイク}、あえなく失敗しました。`,
`${男性}氏が監督を務める新作映画「${お宝}と女」は、主演に起用された${女性}さんが${お宝}の謎を解くサスペンスとなっています。${男性}氏「映画の限界に挑戦したい」`,
`本日未明、${地名}にあるマンションに住む${人物}さんが、${汚れ役}氏の部屋から発生した異臭により気絶しました。${汚れ役}氏「${異臭}」`,
`${地名}にあるマンションに住む${人物}さんが、隣人である${汚れ役}氏のイビキを訴えました。${人物}さん「${騒音}」`,
//
`${人物}さんは、「パワー${お宝}」を購入して以降成功が続いているそうです。${人物}さん「道で${お宝2}を拾ったり、口内炎が3日で治ったりと、いいことづくめです」`,
`${人物}氏に虫歯があることが判明しました。${食べ物}や${食べ物2}を食べた後、歯磨きをしていなかったのが原因とみられます。`,
`今朝早く、${人物}氏宅の冷蔵庫から、5年前の賞味期限シールの付いた${食べ物}が発見されました。${人物}氏「日付がちょうど、5年前の今日だった」`,
`${自治体地名}映画祭のグランプリが、${男性}監督の「${男性2}と${女性}」に決定しました。審査委員長・${男性3}監督「映像の新しい時代の幕開けを感じる」`,
`${ペア1}さんと${ペア2}さんが${食べ物}をめぐりジャンケンをしたところ、「あいこ」が${あいこ}回続きました。現在も記録は更新されている模様です。`,
//
//
]

ニュース乱数=Math.floor(Math.random() * ニュース本文.length);

}