function main(){
数字();
その他関数();
人物関数();
日本関数();
食べ物関数();
アイテム関数();
交通関数();
ニュース差分();

ニュース本文=[
//`【】`,
//
//事件
`【新たな詐欺？！】最近、${お宝}を送りつけて法外な配送料を要求するという、新たな詐欺が横行しています。被害者の${人物}さん（${地名}在住）は、「『宅配拒否は出来ない』などと言われ、配送料として法外な値段を要求された」と話しています。警察は注意を呼びかけています。`,
`【${食べ物2}混入事件】先日、ななし食品（${都心}）は、自社が製造する${食べ物}に${食べ物2}が混入していたことを発表しました。今現在健康被害は報告されていません。なお、ななし食品は${食べ物}を自主回収するとしています。`,
`【${汚れ役}氏逮捕される】${自治体}の店舗で${食べ物}を盗んだ疑いが持たれている${汚れ役}容疑者の身柄が、本日未明、${主要都市}のホテルで拘束されました。${汚れ役}容疑者は、「3日前のことなので、よく覚えていない」と容疑を否認しています。`,
`【${人物}さんの基調講演中止】本日、${主要都市}で開催中のカンファレンスで行われる予定だった、${人物}さんの基調講演が中止になりました。中止となった原因は、何に対しても否定的な${汚れ役}さんが、基調講演の内容にケチをつけ、「基調講演を中止しなければ会場を爆破する」と発言したことだとしています。その後、${汚れ役}さんは現地警察に逮捕された模様です。`,
`【騒音問題】${地名}に住む${人物}さんが、隣人である${汚れ役}さんのイビキにより睡眠不足が続いているとして、${汚れ役}さんを提訴しました。当の${汚れ役}さんは、「そんなにうるさいのか」と驚きを隠せないようでした。`,
//
//世の中の話題
`【${男性}さん来訪予定】本日、人気ランキング１位も確実な${男性}さんが、${自治体}を訪問することを発表しました。${男性}さんは訪問理由として、魅力的な風土を挙げています。早速、地元民の間では期待が高まっているようです。`,
`【${食べ物}フェア開催】本日から、${地名}にあるスーパーで、${食べ物}フェアが行われています。開店前から店の前には長蛇の列が出来ていました。列に並んでいた${人物}さんは、「${行列}」と話しています。`,
`【持つだけでやせる？】最近、若者の間で「${お宝}を持つだけでやせる」というウワサが広がっています。街で${お宝}を持っていた${人物}さんは、「${やせる}」と効果のほどを語っていました。なお、当編集部で実験してみたところ、やせるという確証は得られませんでした。`,
`【${男性}体操が大流行】最近、${男性}体操が幅広い世代に大流行しています。発端は、${男性}さんが健康の為にやり始めたものですが、あまりの流行に「体操をすれば頭が良くなる」「金運が上がる」などといった変な噂が流れたり、体操を勝手にヒップホップ風にアレンジして異性にモテようなどといった人たちも増え、${男性}さんはとても困惑しています。`,
`【マッサージブーム到来】最近、ななし式「${食べ物}マッサージ」が注目を集めています。ななし式マッサージは、${食べ物}でツボを押すのが特徴で、マッサージを受けた${人物}さんは、「従来のマッサージとは別物。これで明日からもがんばろうと思えた」と語っています。`,
//
//文化
`【${男性}監督の新作映画】${男性}氏が監督を務める新作映画の制作発表会見が先日、某所にて行われました。発表された新作「${お宝}と女」は、主演に起用された${女性}さんが${お宝}の謎を解くサスペンスで、監督は、「映画の限界に挑戦したい」と制作へ向けての意気込みを語っていました。`,
`【${自治体地名}映画祭グランプリ決定】先日、${自治体地名}映画祭のグランプリが決定しました。グランプリに輝いたのは、${男性}さんの「${男性2}と${女性}」。ふたりの織り成す切ないラブストーリーを、${男性}さんが1年かけて撮影したものです。審査委員長の${男性3}監督は、「映像の新しい時代の幕開けを感じる」と絶賛していました。`,
//
//交通・道路
//`【】`,
//`【】`,
//
//交通・鉄道
//`【】`,
//`【】`,
//
//交通・駅
//`【】`,
//`【】`,
//
//交通・バス
//`【】`,
//`【】`,
//
//交通・航空
//`【】`,
//`【】`,
//
//その他
`【${食べ物}が盗まれる】先日、${都心}にあるオフィスに勤務する${人物}さんが冷蔵庫を開けたところ、大切に取っておいた${食べ物}が盗まれていることに気付きました。怒り心頭の${人物}さんは、「前にも同じ事が起きた。今回はもう我慢の限界」と話しています。`,
]

ニュース乱数=Math.floor(Math.random() * ニュース本文.length);

}