function main(){
数字();
その他関数();
人物関数();
日本関数();
食べ物関数();
アイテム関数();
交通関数();
ニュース差分();

ニュース本文=[
//
//その他
`先日、${人物}さん（${地名}在住）が、${お宝}を送りつけて法外な配送料を要求するという詐欺に遭いました。警察は注意を呼びかけています。`,
`先日、ななし食品（${都心}）は、自社が製造する${食べ物}に${食べ物2}が混入していたことを発表しました。今のところ健康被害は報告されていない模様です。`,
`${自治体}の店舗で${食べ物}を盗んだ疑いが持たれている${汚れ役}容疑者の身柄が、本日未明、${主要都市}のホテルで拘束されました。`,
`本日、人気ランキング1位も確実な${男性}さんが、${自治体}を訪問することを発表しました。早速、地元民の間では期待が高まっているようです。`,
`${地名}にあるスーパーでは、${食べ物}フェアが開催されており、店の前には長蛇の列が出来ています。列に並んでいた${人物}さん「${行列}」`,
//
//交通
`先日、${駅名}で電車を待っていた${人物}さんが、${汚れ役}氏に誘拐されそうになるという事件が発生しました。しかし、人の目が多かったため、未遂に終わった模様です。`,
`先日、${駅名}のホームで、${汚れ役}氏が${人物}さんに向かって${食べ物}を投げつけました。${汚れ役}氏「イライラしていたのでやった」`,
`先日、${道路}を走行中の車が、突然停止しました。運転者の${汚れ役}さん「${ドライブ[ドライブ乱数][0]}」。同乗者の${汚れ役2}さん「${ドライブ[ドライブ乱数][1]}」`,
//`先日、${航空}の機内で、${汚れ役}氏が突然暴れ出しました。隣の席に座っていた${人物}さん「突然ダダをこね、多くの人を困らせていた」`,
//`先日、${航空}に搭乗していた${人物}さんが、隣の席に座る${汚れ役}氏の異臭により気絶しました。${汚れ役}氏「そんなに臭かったのか」`,
//
//
`${地名}にある某マンションでは、空き部屋から人の声が聞こえてくるそうです。住民の${人物}さん「『${空き部屋}』という声を確かに聞いた」`,
`先日、${都心}のオフィスに勤務する${人物}さんが、昼食に用意した${食べ物}を盗まれていることに気付きました。${人物}さん「前にも同じ事が起きた。今回はもう我慢の限界」`,
`先日未明、${都心}の路上で、${人物}さんが誤ってゴキブリハウスに転倒、接着されてしまいました。${人物}さんは近くを近くを通りかかった${男性}さんによって救助されたものの、${男性}さんが代わりにくっついてしまいました。`,
`${自治体地名}映画祭のグランプリが、${男性}監督の「${男性2}と${女性}」に決定しました。審査委員長・${男性3}監督「映像の新しい時代の幕開けを感じる」`,
`先日、過酷な自転車レース「ツール・ド・${自治体地名}」が開催されました。${男性}選手の腹痛に悩まされながらも、${男性}選手と${人物}選手のペアが優勝を飾りました。`,
]

ニュース乱数=Math.floor(Math.random() * ニュース本文.length);

}