function main(){
数字();
その他関数();
人物関数();
日本関数();
食べ物関数();
アイテム関数();
交通関数();
ニュース差分();

ニュース本文=[
//
//地名
`${地名}にある某マンションでは、空き部屋から人の声が聞こえてくるそうです。住民の${人物}さん「『${空き部屋}』という声を確かに聞いた」`,
`先日、${人物}さん（${地名}在住）が帰宅し、冷蔵庫を開けたところ、大切に取っておいた${スイーツ}が消えていることに気付きました。${人物}さんは非常にショックを受けている模様です。`,
`${地名}にあるスーパーでは、${食べ物}フェアが開催されており、店の前には長蛇の列が出来ています。列に並んでいた${人物}さん「${行列}」`,
`先日、${人物}さん（${地名}在住）が、近所の排水溝で${お宝}を発見しました。この${お宝}は、しばらく警察署に保管された後、落とし主が見つからなければ${人物}さんの物になるとのことです。`,
//
//都心
`先日、${都心}のオフィスに勤務する${人物}さんが、昼食に用意した${食べ物}を盗まれていることに気付きました。${人物}さん「前にも同じ事が起きた。今回はもう我慢の限界」`,
`先日未明、${都心}の路上で、${人物}さんが誤ってゴキブリハウスに転倒、接着されてしまいました。${人物}さんは近くを通りかかった${男性}さんによって救助されたものの、${男性}さんが代わりにくっついてしまいました。`,
`${都心}にある${お宝}専門店には、連日長蛇の列が出来ています。${お宝}を買いにきた${人物}さん「${行列}」`,
`最近、${食べ物}の天ぷら、${食べ物}寿司、焼${食べ物}など${食べ物}づくしが楽しめる「${食べ物}道楽」（${都心}）が話題になっています。`,
//
//自治体
`${自治体}の店舗で${食べ物}を盗んだ疑いが持たれている${汚れ役}容疑者の身柄が、本日未明、${主要都市}のホテルで拘束されました。`,
`先日、${自治体}にある温泉のロッカーで、パンツの忘れ物が発見されました。利用者によると、「あの柄からして、${人物}さんのパンツでは？」とのことです。`,
`${自治体地名}映画祭のグランプリが、${男性}監督の「${男性2}と${女性}」に決定しました。審査委員長・${男性3}監督「映像の新しい時代の幕開けを感じる」`,
`先日、過酷な自転車レース「ツール・ド・${自治体地名}」が開催されました。${男性}選手の腹痛に悩まされながらも、${男性}選手と${人物}選手のペアが優勝を飾りました。`,
//
//交通
`先日、${駅名}で電車を待っていた${人物}さんが、${汚れ役}氏に誘拐されそうになるという事件が発生しました。しかし、人の目が多かったため、未遂に終わった模様です。`,
`先日、${駅名}のホームで、${汚れ役}氏が${人物}さんに向かって${食べ物}を投げつけました。${汚れ役}氏「イライラしていたのでやった」`,
`先日、${駅名}近くの路上に${お宝}が落ちているのを${男性}さんが発見し、警察に届けました。落とし主の${人物}さん「何時間も探した。見つかってよかった」`,
`先日、${駅名}のホームで、電話をしていた${人物}さんが、${お宝}を落としてしまいました。しかし、${男性}さんが間一髪でキャッチしたため、壊れずに済んだ模様です。`,
//
//その他
`先日、ななし食品（${都心}）は、自社が製造する${食べ物}に${食べ物2}が混入していたことを発表しました。今のところ健康被害は報告されていない模様です。`,
`先日、転勤のため${人物}さんが${コミューター}へと旅立ちました。${人物}さんを見送ろうと空港には多くの人が集まりました。`,
]

ニュース乱数=Math.floor(Math.random() * ニュース本文.length);

}