function ニュース差分(){

その他関数();
人物関数();
日本関数();

ペアリスト=[
[`${人物}`,`${男性}`],
[`${男性}`,`${人物}`],
]
ペア乱数=Math.floor(Math.random() * ペアリスト.length);
ペア1=`${ペアリスト[ペア乱数][0]}`
ペア2=`${ペアリスト[ペア乱数][1]}`

行列リスト=[
`みんなが並んでるので並んだ`,
`２０個は買うつもり`,
`品切れにならないか心配`,
]
行列乱数=Math.floor(Math.random() * 行列リスト.length);
行列=`<font color="deeppink">${行列リスト[行列乱数]}</font>`

やせるリスト=[
`これを持ち始めて、体重が１００ｇ減った`,
`あと５０個持てばやせられるかもしれない`,
`べ、別にやせたくて持ってるわけじゃないですから`,
]
やせる乱数=Math.floor(Math.random() *やせるリスト.length);
やせる=`<font color="deeppink">${やせるリスト[やせる乱数]}</font>`


}