function ニュース差分(){

その他関数();
人物関数();
交通関数();
日本関数();

ペアリスト=[
[`${人物}`,`${男性}`],
[`${男性}`,`${人物}`],
]
ペア乱数=Math.floor(Math.random() * ペアリスト.length);
ペア1=`${ペアリスト[ペア乱数][0]}`
ペア2=`${ペアリスト[ペア乱数][1]}`

行列リスト=[
`みんなが並んでるので並んだ`,
`２０個は買うつもり`,
`品切れにならないか心配`,
]
行列乱数=Math.floor(Math.random() * 行列リスト.length);
行列=`<font color="deeppink">${行列リスト[行列乱数]}</font>`

空き部屋リスト=[
`最近電気代高いわ～`,
`トイレの水が流れない！`,
`ちょっとタオル取って～`,
`もやしが余っちゃったわ。どうしましょう`,
`ちょっとティッシュ買ってきてー`,
]
空き部屋乱数=Math.floor(Math.random() * 空き部屋リスト.length);
空き部屋=`<font color="deeppink">${空き部屋リスト[空き部屋乱数]}</font>`

転勤リスト=[
`${コミューター}`,
`${主要都市}`,
]
転勤乱数=Math.floor(Math.random() * 転勤リスト.length);
転勤=`<font color="deeppink">${転勤リスト[転勤乱数]}</font>`

}