function ニュース差分(){

その他関数();
人物関数();
日本関数();

ペアリスト=[
[`${人物}`,`${男性}`],
[`${男性}`,`${人物}`],
]
ペア乱数=Math.floor(Math.random() * ペアリスト.length);
ペア1=`${ペアリスト[ペア乱数][0]}`
ペア2=`${ペアリスト[ペア乱数][1]}`



えんぴつリスト=[
`必死な顔をしていたので、仕方なく交換してあげた`,
`おかしなことをする人もいるもんだ`,
]
えんぴつ乱数=Math.floor(Math.random() * えんぴつリスト.length);
えんぴつ=`<font color="deeppink">${えんぴつリスト[えんぴつ乱数]}</font>`


行列リスト=[
`みんなが並んでるので並んだ`,
`２０個は買うつもり`,
`品切れにならないか心配`,
]
行列乱数=Math.floor(Math.random() * 行列リスト.length);
行列=`<font color="deeppink">${行列リスト[行列乱数]}</font>`


空き部屋リスト=[
`最近電気代高いわ～`,
`トイレの水が流れない！`,
`ちょっとタオル取って～`,
`もやしが余っちゃったわ。どうしましょう`,
`ちょっとティッシュ買ってきてー`,
]
空き部屋乱数=Math.floor(Math.random() * 空き部屋リスト.length);
空き部屋=`<font color="deeppink">${空き部屋リスト[空き部屋乱数]}</font>`


水中リスト=[
`１０秒しか息が続かず`,
`思い出し笑いをし`,
`自分のこの姿が情けなくなり`,
`寒さでトイレに行きたくなり`,
]
水中乱数=Math.floor(Math.random() * 水中リスト.length);
水中=`<font color="deeppink">${水中リスト[水中乱数]}</font>`


バイクリスト=[
`思った以上にバイクが重くて`,
`まず、基本姿勢を維持できず`,
`上に乗ったままバイクがエンストを起こし`,
`バイクが来る前に怖気づき`,
]
バイク乱数=Math.floor(Math.random() * バイクリスト.length);
バイク=`<font color="deeppink">${バイクリスト[バイク乱数]}</font>`


異臭リスト=[
`しばらく、お風呂に入っていなかった`,
`冷蔵庫の中の物が腐っていた`,
`料理に何か混ぜたらとても臭いものになった`,
]
異臭乱数=Math.floor(Math.random() * 異臭リスト.length);
異臭=`<font color="deeppink">${異臭リスト[異臭乱数]}</font>`


騒音リスト=[
`鼻に洗濯バサミを付けて寝て`,
`鼻に栓を詰めて欲しい`,
`顔を囲って欲しい`,
]
騒音乱数=Math.floor(Math.random() * 騒音リスト.length);
騒音=`<font color="deeppink">${騒音リスト[騒音乱数]}</font>`

}