function その他関数(){

主要国リスト=[
{name: "韓国", city: ["ソウル",]},
{name: "中国", city: ["北京","上海","深圳",]},
{name: "台湾", city: ["台北",]},
//
{name: "ロシア", city: ["モスクワ",]},
//
{name: "イギリス", city: ["ロンドン",]},
{name: "フランス", city: ["パリ",]},
{name: "ドイツ", city: ["ベルリン","フランクフルト","ミュンヘン",]},
{name: "イタリア", city: ["ローマ","ミラノ",]},
{name: "スペイン", city: ["マドリード","バルセロナ",]},
{name: "ベルギー", city: ["ブリュッセル",]},
{name: "オランダ", city: ["アムステルダム",]},
{name: "スイス", city: ["チューリッヒ",]},
{name: "デンマーク", city: ["コペンハーゲン",]},
{name: "ノルウェー", city: ["オスロ",]},
{name: "スウェーデン", city: ["ストックホルム",]},
{name: "フィンランド", city: ["ヘルシンキ",]},
{name: "アイルランド", city: ["ダブリン",]},
//
{name: "アメリカ", city: ["ニューヨーク","ロサンゼルス","シカゴ","ヒューストン","フィラデルフィア","サンディエゴ","ダラス","サンノゼ","サンフランシスコ","シアトル","ワシントンDC","ラスベガス","ボストン","デトロイト","アトランタ","マイアミ","ミネアポリス","ホノルル",]},
{name: "カナダ", city: ["バンクーバー","トロント","モントリオール",]},
{name: "メキシコ", city: ["メキシコシティ",]},
{name: "ブラジル", city: ["サンパウロ","リオデジャネイロ",]},
//
{name: "オーストラリア", city: ["シドニー","メルボルン","パース","ブリズベン",]},
{name: "ニュージーランド", city: ["オークランド","クライストチャーチ",]},
]

主要国乱数=Math.floor(Math.random() * 主要国リスト.length);
主要都市乱数=Math.floor(Math.random() * 主要国リスト[主要国乱数].city.length);

主要都市=`<font color="springgreen ">${主要国リスト[主要国乱数]["name"]}・${主要国リスト[主要国乱数].city[主要都市乱数]}</font>`

流体リスト=[
`硫酸`,
`重油`,
`軽油`,
`アンモニア溶液`,
`ホルミウム溶液`,
`フルオロケトン`,
]
流体乱数=Math.floor(Math.random() * 流体リスト.length);
流体=`<font color="orange">${流体リスト[流体乱数]}</font>`
}