function 人物関数(){

人物リスト=[
`岡崎朋也`,
`古河渚`,
`藤林杏`,
`一ノ瀬ことみ`,
`坂上智代`,
`伊吹風子`,
`宮沢有紀寧`,
`春原陽平`,
//
]
人物乱数=Math.floor(Math.random() * 人物リスト.length);

人物=`<font color="khaki ">${人物リスト[人物乱数]}</font>`

男性リスト=[
`石破茂`,
`岸田文雄`,
`菅義偉`,
`安倍晋三`,
`野田佳彦`,
`菅直人`,
`鳩山由紀夫`,
`麻生太郎`,
`福田康夫`,
`安倍晋三`,
`小泉純一郎`,
`森喜朗`,
`小渕恵三`,
`橋本龍太郎`,
`村山富市`,
`羽田孜`,
`竹下登`,
`中曾根康弘`,
`田中角栄`,
`佐藤栄作`,
`岸信介`,
`吉田茂`,
`東久邇宮稔彦王`,
`鈴木貫太郎`,
`小磯國昭`,
`東條英機`,
`近衞文麿`,
`李承晩`,
`朴正煕`,
`全斗煥`,
`盧泰愚`,
`金泳三`,
`金大中`,
`盧武鉉`,
`李明博`,
`文在寅`,
`尹錫悦`,
`李在明`,
`金正恩`,
`金日成`,
`金正日`,
`レーニン`,
`スターリン`,
`フルシチョフ`,
`ヒトラー`,
`毛沢東`,
`鄧小平`,
`習近平`,
`トルーマン`,
`ケネディ`,
`オバマ`,
`トランプ`,
`バイデン`,
]
男性乱数=Math.floor(Math.random() * 男性リスト.length);
男性乱数2=Math.floor(Math.random() * 男性リスト.length);
男性乱数3=Math.floor(Math.random() * 男性リスト.length);

if(男性リスト[男性乱数]==男性リスト[男性乱数2] ||  男性リスト[男性乱数]==男性リスト[男性乱数3] || 男性リスト[男性乱数2]==男性リスト[男性乱数3]){
人物関数();
}

男性=`<font color=lightblue >${男性リスト[男性乱数]}</font>`
男性2=`<font color=lightblue >${男性リスト[男性乱数2]}</font>`
男性3=`<font color=lightblue >${男性リスト[男性乱数3]}</font>`

女性リスト=[
`神尾観鈴`,
`古河渚`,
`藤林杏`,
]
女性乱数=Math.floor(Math.random() * 女性リスト.length);
女性乱数2=Math.floor(Math.random() * 女性リスト.length);

女性=`<font color=pink>${女性リスト[女性乱数]}</font>`

汚れ役リスト=[
`TNOK`,
`田所浩二`,
`遠野`,
`KBTIT`,
`ひで`,
`我修院`,
`課長`,
`ガバ穴ダディー`,
`島田部長`,
`ケツデカ課長`,
`現場監督`,
`OGMM`,
`クチマン爺`,
`77歳の肛門モロ感の親爺`,
`淫乱テディベア`
]
汚れ役乱数=Math.floor(Math.random() * 汚れ役リスト.length);
汚れ役乱数2=Math.floor(Math.random() * 汚れ役リスト.length);
汚れ役=`<font color="wheat ">${汚れ役リスト[汚れ役乱数]}</font>`
汚れ役2=`<font color="wheat ">${汚れ役リスト[汚れ役乱数2]}</font>`

if(汚れ役リスト[汚れ役乱数]==汚れ役リスト[汚れ役乱数2]){
人物関数();
}



唐澤貴洋=`<font color="wheat ">唐澤貴洋</font>`

}
