function 日本関数(){

都市リスト=[
{name: "北海道", city: ["札幌市","江別市","千歳市","恵庭市","北広島市","石狩市","岩見沢市","夕張市","新十津川町","小樽市","ニセコ町","倶知安町","函館市","木古内町","八雲町","長万部町","江差町","室蘭市","苫小牧市","登別市","旭川市","士別市","名寄市","富良野市","音威子府村","留萌市","増毛町","稚内市","幌延町","北見市","網走市","紋別市","美幌町","斜里町","遠軽町","帯広市","上士幌町","士幌町","新得町","陸別町","足寄町","釧路市","厚岸町","標茶町","根室市","別海町","羅臼町","標津町","中標津町",]},
{name: "青森県", city: ["青森市","弘前市","八戸市","五所川原市","十和田市","三沢市","むつ市","野辺地町","大間町",]},
{name: "岩手県", city: ["盛岡市","宮古市","大船渡市","花巻市","北上市","久慈市","遠野市","一関市","陸前高田市","釜石市","二戸市","雫石町",]},
{name: "宮城県", city: ["仙台市","石巻市","気仙沼市","白石市","名取市","多賀城市","岩沼市","登米市","栗原市","東松島市","大崎市","女川町","南三陸町",]},
{name: "秋田県", city: ["秋田市","能代市","横手市","大館市","男鹿市","湯沢市","鹿角市","由利本荘市","にかほ市",]},
{name: "山形県", city: ["山形市","米沢市","鶴岡市","酒田市","新庄市","寒河江市",]},
{name: "福島県", city: ["福島市","会津若松市","郡山市","いわき市","白河市","須賀川市","喜多方市","相馬市","二本松市","南会津町","只見町","檜枝岐村",]},
{name: "茨城県", city: ["水戸市","日立市","土浦市","古河市","石岡市","結城市","龍ケ崎市","下妻市","常総市","常陸太田市","高萩市","笠間市","取手市","牛久市","つくば市","ひたちなか市","鹿嶋市","潮来市","守谷市","常陸大宮市","筑西市","坂東市","稲敷市","かすみがうら市","桜川市","神栖市","つくばみらい市","鉾田市","小美玉市","大洗町","阿見町","境町","五霞町",]},
{name: "栃木県", city: ["宇都宮市","足利市","栃木市","佐野市","鹿沼市","日光市","小山市","真岡市","矢板市","那須塩原市","那須烏山市","下野市","上三川町","芳賀町","益子町","茂木町","市貝町","壬生町","高根沢町","那須町",]},
{name: "群馬県", city: ["前橋市","高崎市","桐生市","伊勢崎市","太田市","沼田市","館林市","渋川市","藤岡市","富岡市","安中市","下仁田町","中之条町","長野原町","片品村","川場村","大泉町",]},
{name: "埼玉県", city: ["さいたま市","川越市","熊谷市","川口市","行田市","秩父市","所沢市","飯能市","加須市","本庄市","東松山市","春日部市","狭山市","羽生市","鴻巣市","深谷市","上尾市","草加市","越谷市","蕨市","戸田市","入間市","朝霞市","志木市","和光市","新座市","桶川市","久喜市","北本市","八潮市","富士見市","三郷市","蓮田市","坂戸市","幸手市","鶴ヶ島市","日高市","吉川市","ふじみ野市","白岡市","伊奈町","三芳町","越生町","嵐山町","横瀬町","長瀞町","小鹿野町","松伏町","杉戸町",]},
{name: "千葉県", city: ["千葉市","銚子市","市川市","船橋市","館山市","木更津市","松戸市","野田市","茂原市","成田市","佐倉市","東金市","旭市","習志野市","柏市","勝浦市","市原市","流山市","八千代市","我孫子市","鴨川市","鎌ケ谷市","君津市","富津市","浦安市","四街道市","袖ケ浦市","八街市","印西市","白井市","富里市","南房総市","匝瑳市","香取市","山武市","いすみ市","大網白里市","酒々井町","多古町","神崎町","横芝光町","九十九里町","芝山町","御宿町","大多喜町","鋸南町",]},
{name: "東京都", city: ["千代田区","中央区","港区","新宿区","文京区","台東区","墨田区","江東区","品川区","目黒区","大田区","世田谷区","渋谷区","中野区","杉並区","豊島区","北区","荒川区","板橋区","練馬区","足立区","葛飾区","江戸川区","八王子市","立川市","武蔵野市","三鷹市","青梅市","昭島市","調布市","町田市","小金井市","小平市","日野市","東村山市","国分寺市","国立市","福生市","狛江市","東大和市","清瀬市","東久留米市","武蔵村山市","多摩市","稲城市","羽村市","あきる野市","西東京市","瑞穂町","日の出町","檜原村","奥多摩町",]},
{name: "神奈川県", city: ["横浜市","川崎市","相模原市","横須賀市","平塚市","鎌倉市","藤沢市","小田原市","茅ヶ崎市","逗子市","三浦市","秦野市","厚木市","大和市","伊勢原市","海老名市","座間市","南足柄市","綾瀬市","葉山町","大磯町","真鶴町","湯河原町",]},
{name: "新潟県", city: ["新潟市","長岡市","三条市","柏崎市","新発田市","小千谷市","加茂市","十日町市","見附市","村上市","燕市","糸魚川市","妙高市","五泉市","上越市","阿賀野市","魚沼市","南魚沼市","佐渡市","弥彦村","湯沢町",]},
{name: "富山県", city: ["富山市","高岡市","魚津市","氷見市","滑川市","黒部市","砺波市","小矢部市","南砺市","射水市","入善町",]},
{name: "石川県", city: ["金沢市","七尾市","小松市","輪島市","珠洲市","加賀市","羽咋市","かほく市","白山市","穴水町",]},
{name: "福井県", city: ["福井市","敦賀市","鯖江市","越前市",]},
{name: "山梨県", city: ["甲府市","富士吉田市","都留市","山梨市","大月市","韮崎市","北杜市","上野原市",]},
{name: "長野県", city: ["長野市","松本市","上田市","岡谷市","飯田市","諏訪市","須坂市","小諸市","伊那市","駒ヶ根市","大町市","飯山市","茅野市","塩尻市","佐久市","千曲市","安曇野市","南木曽町","白馬村","小谷村","坂城町","小布施町","木島平村","野沢温泉村",]},
{name: "岐阜県", city: ["岐阜市","大垣市","高山市","多治見市","関市","中津川市","美濃市","瑞浪市","羽島市","恵那市","美濃加茂市","土岐市","各務原市","可児市","飛驒市","本巣市","下呂市","郡上市","海津市","養老町","関ケ原町",]},
{name: "静岡県", city: ["静岡市","浜松市","沼津市","熱海市","三島市","富士宮市","伊東市","島田市","富士市","磐田市","焼津市","掛川市","藤枝市","御殿場市","袋井市","下田市","裾野市","伊豆市","御前崎市","伊豆の国市","牧之原市","東伊豆町","南伊豆町","西伊豆町","函南町",]},
{name: "愛知県", city: ["名古屋市","豊橋市","岡崎市","一宮市","春日井市","豊川市","豊田市","安城市","犬山市","常滑市","小牧市","岩倉市","長久手市","蟹江町","南知多町","設楽町",]},
{name: "三重県", city: ["津市","四日市市","伊勢市","松阪市","桑名市","鈴鹿市","名張市","尾鷲市","亀山市","鳥羽市","熊野市","志摩市","伊賀市",]},
{name: "滋賀県", city: ["大津市","彦根市","長浜市","近江八幡市","草津市","守山市","栗東市","野洲市","米原市",]},
{name: "京都府", city: ["京都市","福知山市","舞鶴市","宇治市","亀岡市",]},
{name: "大阪府", city: ["大阪市","堺市","岸和田市","豊中市","吹田市","泉大津市","高槻市","貝塚市","守口市","枚方市","茨木市","八尾市","泉佐野市","富田林市","門真市","東大阪市","泉南市","四條畷市",]},
{name: "兵庫県", city: ["神戸市","姫路市","尼崎市","明石市","西宮市","洲本市","芦屋市","伊丹市","相生市","豊岡市","加古川市","赤穂市","西脇市","宝塚市","三木市","川西市","三田市","香美町","小野市",]},
{name: "奈良県", city: ["奈良市","大和郡山市","橿原市","五條市","生駒市","十津川村",]},
{name: "和歌山県", city: ["和歌山市","橋本市","御坊市","田辺市","白浜町","串本町","那智勝浦町",]},
{name: "鳥取県", city: ["鳥取市","米子市","倉吉市","境港市","智頭町",]},
{name: "島根県", city: ["松江市","浜田市","出雲市","益田市",]},
{name: "岡山県", city: ["岡山市","倉敷市","津山市","高梁市","新見市","真庭市",]},
{name: "広島県", city: ["広島市","呉市","三原市","尾道市","福山市","三次市","東広島市","廿日市市","江田島市",]},
{name: "山口県", city: ["下関市","宇部市","山口市","萩市","防府市","下松市","岩国市","長門市",]},
{name: "徳島県", city: ["徳島市","鳴門市","小松島市",]},
{name: "香川県", city: ["高松市","丸亀市","坂出市","善通寺市","観音寺市","三豊市","琴平町",]},
{name: "愛媛県", city: ["松山市","今治市","宇和島市","八幡浜市","新居浜市","四国中央市","大洲市",]},
{name: "高知県", city: ["高知市","室戸市","安芸市","土佐清水市","宿毛市","須崎市","南国市","土佐市",]},
{name: "福岡県", city: ["北九州市","福岡市","大牟田市","久留米市","直方市","飯塚市","行橋市","筑紫野市","大野城市",]},
{name: "佐賀県", city: ["佐賀市","唐津市","鳥栖市","伊万里市","武雄市","嬉野市","有田町",]},
{name: "長崎県", city: ["長崎市","佐世保市","島原市","諫早市","大村市","平戸市","松浦市","雲仙市","南島原市",]},
{name: "熊本県", city: ["熊本市","八代市","人吉市","荒尾市","水俣市","玉名市","山鹿市","宇土市","阿蘇市","大津町",]},
{name: "大分県", city: ["大分市","別府市","中津市","日田市","佐伯市","臼杵市","豊後高田市",]},
{name: "宮崎県", city: ["宮崎市","都城市","延岡市","日南市","日向市",]},
{name: "鹿児島県", city: ["鹿児島市","鹿屋市","枕崎市","阿久根市","出水市","指宿市","垂水市","薩摩川内市","霧島市","志布志市","姶良市",]},
{name: "沖縄県", city: ["那覇市","宜野湾市","浦添市","名護市","糸満市","沖縄市","豊見城市",]},
]

都道府県乱数=Math.floor(Math.random() * 都市リスト.length);
都市乱数=Math.floor(Math.random() * 都市リスト[都道府県乱数].city.length);

自治体=`<font color="springgreen">${都市リスト[都道府県乱数]["name"]}${都市リスト[都道府県乱数].city[都市乱数]}</font>`
自治体地名=`<font color="springgreen">${都市リスト[都道府県乱数].city[都市乱数].slice(0,-1)}</font>`

地名リスト=[
{name:"北区",place:["赤羽","赤羽台","岩淵町","西が丘","桐ケ丘","志茂","王子","上十条","十条台","十条仲原","中十条","東十条","神谷","豊島","滝野川","田端","上中里","中里","西ケ原","堀船",]},
{name:"板橋区",place:["板橋","本町","加賀","稲荷台","仲宿","仲町","大山町","熊野町","小茂根","中板橋","向原","弥生町","氷川町","常盤台","上板橋","富士見町","大和町","志村","小豆沢","蓮沼町","西台","蓮根","坂下","舟渡","赤塚","成増","高島平","新河岸","三園",]},
{name:"足立区",place:["千住","千住曙町","千住旭町","千住桜木","千住関屋町","千住中居町","扇","興野","関原","西新井","西新井本町","本木","梅田","梅島","栗原","島根","中央本町","西新井栄町","一ツ家","平野","小台","加賀","江北","皿沼","鹿浜","新田","宮城","谷在家","入谷","古千谷","舎人","竹の塚","保木間","六町","伊興","大谷田","佐野","東和","中川","東綾瀬","青井","足立","綾瀬","弘道","西綾瀬","加平","神明","神明南","辰沼","西加平","花畑","南花畑","六木","谷中",]},
{name:"葛飾区",place:["立石","四つ木","金町","東金町","新宿","亀有","西亀有","青戸","白鳥","新小岩","奥戸","高砂","柴又","細田","堀切","お花茶屋","小菅","水元","南水元","西水元","東水元",]},
{name:"江戸川区",place:["中央","松江","小松川","大杉","一之江","西瑞江","上一色","平井","船堀","西葛西","中葛西","南葛西","堀江町","清新町","北小岩","西小岩","東小岩","南小岩","瑞江","江戸川","鹿骨","上篠崎","篠崎町",]},
{name:"品川区",place:["荏原","大井","大崎","勝島","北品川","小山","小山台","戸越","中延","西大井","旗の台","八潮",]},
{name:"目黒区",place:["大岡山","上目黒","駒場","下目黒","自由が丘","洗足","中目黒","碑文谷","目黒","目黒本町","祐天寺",]},
{name:"大田区",place:["大森中","大森東","大森南","大森西","大森本町","大森北","東馬込","中馬込","西馬込","中央","南馬込","池上","田園調布南","田園調布本町","田園調布","雪谷大塚町","鵜の木","南久が原","久が原","東雪谷","南雪谷","雪谷大塚町","南千束","北千束","東糀谷","西糀谷","北糀谷","羽田旭町","本羽田","萩中","東六郷","西六郷","南六郷","仲六郷","南蒲田","千鳥","下丸子","矢口","東矢口","多摩川","新蒲田","西蒲田","東蒲田","南蒲田","蒲田","蒲田本町",]},
{name:"世田谷区",place:["池尻","太子堂","三軒茶屋","若林","世田谷","弦巻","宮坂","桜丘","経堂","下馬","上馬","駒沢","代田","梅丘","豪徳寺","代沢","池尻","大原","北沢","松原","桜上水","東玉川","奥沢","玉堤","等々力","尾山台","上野毛","野毛","中町","上用賀","用賀","玉川台","玉川","瀬田","駒沢","桜新町","深沢","成城","祖師谷","千歳台","船橋","喜多見","砧","上北沢","八幡山","上祖師谷","給田","南烏山","北烏山",]},
{name:"中野区",place:["新井","江古田","上鷺宮","鷺宮","白鷺","中央","中野","沼袋","野方","東中野","本町","丸山","大和町","弥生町","若宮",]},
{name:"杉並区",place:["阿佐谷北","井草","上井草","下井草","和泉","永福","方南","浜田山","荻窪","上荻","南荻窪","高円寺北","高円寺南","松ノ木","上高井戸","下高井戸","久我山","善福寺",]},
{name:"練馬区",place:["旭丘","向山","小竹町","桜台","豊玉中","中村","練馬","春日町","北町","平和台","氷川台","光が丘","旭町","高松","谷原","富士見台","高野台","南田中","上石神井","下石神井","石神井町","大泉学園町","大泉町","関町北",]},
]
地名乱数=Math.floor(Math.random() * 地名リスト.length);
町名乱数=Math.floor(Math.random() * 地名リスト[地名乱数].place.length);
地名=`<font color="springgreen">${地名リスト[地名乱数]["name"]}${地名リスト[地名乱数].place[町名乱数]}</font>`

都心リスト=[
{name:"千代田区",place:["丸の内","大手町","内幸町","有楽町","霞が関","永田町","隼町","平河町","麹町","紀尾井町","九段南","一ツ橋","九段北","富士見","飯田橋","神保町","西神田","駿河台","小川町","内神田","淡路町","外神田","岩本町","須田町","東神田",]},
{name:"中央区",place:["明石町","銀座一丁目","銀座二丁目","銀座三丁目","銀座四丁目","銀座五丁目","銀座六丁目","銀座七丁目","銀座八丁目","新富町","築地","八丁堀","東日本橋","八重洲","日本橋","兜町","茅場町","小伝馬町","人形町","馬喰町","箱崎","浜町","室町","勝どき","月島","佃二","豊海","晴海",]},
{name:"港区",place:["新橋","東新橋","西新橋","虎ノ門","愛宕","芝公園","浜松町","芝","三田","東麻布","麻布台","麻布十番","西麻布","南麻布","六本木","赤坂","北青山","南青山","白金","白金台","高輪","港南","芝浦","台場",]},
{name:"新宿区",place:["神楽坂","歌舞伎町","下宮比町","西早稲田","鶴巻町","早稲田","馬場下町","山吹町","大久保","百人町","戸山","下落合","中井","西新宿","北新宿","高田馬場","四谷","信濃町","新宿一丁目","新宿二丁目","新宿三丁目","新宿四丁目","新宿五丁目",]},
{name:"文京区",place:["大塚","音羽","春日","小石川","関口","千石","千駄木","根津","白山","本郷","本駒込","湯島",]},
{name:"台東区",place:["浅草橋","蔵前","元浅草","駒形","西浅草","上野","下谷","上野桜木","谷中","浅草","入谷","雷門","花川戸","千束","今戸","東浅草","三ノ輪",]},
{name:"墨田区",place:["吾妻橋","東駒形","本所","向島","押上","菊川","錦糸町","業平","東向島","八広",]},
{name:"江東区",place:["枝川","木場","塩浜","潮見","東陽町","豊洲","青海","有明","東雲","新木場","辰巳","夢の島","若洲","森下","清澄白河","深川","門前仲町","永代","越中島","福住","住吉","猿江","亀戸","大島","北砂","東砂","南砂町","新砂",]},
{name:"渋谷区",place:["渋谷","神泉","道玄坂","恵比寿","広尾","代官山","代々木上原","富ヶ谷","松濤","初台","代々木","笹塚","幡ヶ谷","千駄ヶ谷","神宮前","神南",]},
{name:"豊島区",place:["池袋","上池袋","北大塚","雑司が谷","西池袋","東池袋","南池袋","目白","駒込","巣鴨","南大塚","西巣鴨","北大塚","東池袋","南長崎","要町","千川",]},
{name:"荒川区",place:["町屋","西尾久","西日暮里","東尾久","東日暮里","南千住",]},
]
都心乱数=Math.floor(Math.random() * 都心リスト.length);
都心町名乱数=Math.floor(Math.random() * 都心リスト[都心乱数].place.length);
都心=`<font color="springgreen">${都心リスト[都心乱数]["name"]}${都心リスト[都心乱数].place[都心町名乱数]}</font>`

}