function その他(){

流体リスト=[
`原油`,
`フッ素`,
`リチウム塩水`,
`硫酸`,
`重油`,
`軽油`,
`石油ガス`,
`潤滑油`,
`ホルミウム溶液`,
`電解液`,
`アンモニア`,
]
流体乱数=Math.floor(Math.random() * 流体リスト.length);

流体=`<font color="lightcoral ">${流体リスト[流体乱数]}</font>`

バス=[
["渋谷駅","新橋駅"],
["渋谷駅","田町駅"],
["高田馬場駅前","早大正門"],
["練馬車庫前","新宿駅西口"],
["浅草寿町","足立梅田町"],
["浅草雷門","足立区役所"],
["北千住駅","駒込病院"],
["北千住駅","竹の塚駅"],
["王子駅","千住車庫前"],
["門前仲町","東京テレポート駅"],
["亀戸駅","東陽町駅 "],
["日暮里駅","錦糸町駅"],
["日暮里駅","亀戸駅"],
["錦糸町駅","門前仲町"],
["門前仲町","東京ビッグサイト"],
["池袋駅東口","西新井駅"],
["大塚駅","錦糸町駅"],
["池袋駅東口","浅草寿町"],
["一之江駅","葛西駅"],
["東京駅丸の内南口","晴海埠頭"],
["東京駅丸の内南口","東京ビッグサイト"],
["早稲田","上野松坂屋"],
]
バス乱数=Math.floor(Math.random() * バス.length);

busfrom=`<font color="springgreen ">${バス[バス乱数][0]}</font>`
busto=`<font color="springgreen ">${バス[バス乱数][1]}</font>`


}