function その他(){



流体リスト=[
`原油`,
`フッ素`,
`リチウム塩水`,
`硫酸`,
`重油`,
`軽油`,
`石油ガス`,
`潤滑油`,
`ホルミウム溶液`,
`電解液`,
`アンモニア`,
]
流体乱数=Math.floor(Math.random() * 流体リスト.length);
流体=`<font color="lightcoral ">${流体リスト[流体乱数]}</font>`

航空短距離=[
{from: ["東京",], to:["札幌","釧路","女満別","旭川","帯広","函館","青森","三沢","秋田","山形","富山","小松","大阪","神戸","鳥取","出雲","岡山","広島","徳島","高松","松山","高知","福岡","北九州","佐賀","長崎","熊本","大分","宮崎","鹿児島","奄美大島","那覇","宮古島","石垣島",]},
{from: ["札幌","釧路","女満別","旭川","帯広","函館","青森","三沢","秋田","山形","富山","小松","大阪","神戸","鳥取","出雲","岡山","広島","徳島","高松","松山","高知","福岡","北九州","佐賀","長崎","熊本","大分","宮崎","鹿児島","奄美大島","那覇","宮古島","石垣島",], to : ["東京"]}
]

短距離乱数=Math.floor(Math.random() * 航空短距離.length);
短距離出発乱数=Math.floor(Math.random() * 航空短距離[短距離乱数].from.length);
短距離到着乱数=Math.floor(Math.random() * 航空短距離[短距離乱数].to.length);

短距離出発=`<font color="springgreen">${航空短距離[短距離乱数].from[短距離出発乱数]}</font>`
短距離到着=`<font color="springgreen">${航空短距離[短距離乱数].to[短距離到着乱数]}</font>`



}