function その他(){

流体リスト=[
`原油`,
`フッ素`,
`リチウム塩水`,
`硫酸`,
`重油`,
`軽油`,
`石油ガス`,
`潤滑油`,
`ホルミウム溶液`,
`電解液`,
`アンモニア`,
]
流体乱数=Math.floor(Math.random() * 流体リスト.length);

流体=`<font color="lightcoral ">${流体リスト[流体乱数]}</font>`

バス=[
["渋谷駅","新橋駅"],
["渋谷駅","田町駅"],
["高田馬場駅前","早大正門"],
["練馬車庫前","新宿駅西口"],
["浅草寿町","足立梅田町"],
["浅草雷門","足立区役所"],
["北千住駅","駒込病院"],
["北千住駅","竹の塚駅"],
["王子駅","千住車庫前"],
["門前仲町","東京テレポート駅"],
["亀戸駅","東陽町駅 "],
["日暮里駅","錦糸町駅"],
["日暮里駅","亀戸駅"],
["錦糸町駅","門前仲町"],
["門前仲町","東京ビッグサイト"],
["池袋駅東口","西新井駅"],
["大塚駅","錦糸町駅"],
["池袋駅東口","浅草寿町"],
["一之江駅","葛西駅"],
["東京駅丸の内南口","晴海埠頭"],
["東京駅丸の内南口","東京ビッグサイト"],
["早稲田","上野松坂屋"],
]
バス乱数=Math.floor(Math.random() * バス.length);

busfrom=`<font color="springgreen ">${バス[バス乱数][0]}</font>`
busto=`<font color="springgreen ">${バス[バス乱数][1]}</font>`

航空=[
["東京","メルボルン"],
["東京","シドニー"],
["東京","バンクーバー"],
["東京","コペンハーゲン"],
["東京","カイロ"],
["東京","ヘルシンキ"],
["東京","パリ"],
["東京","デュッセルドルフ"],
["東京","フランクフルト"],
["東京","デリー"],
["東京","ムンバイ"],
["東京","ジャカルタ"],
["東京","ミラノ"],
["東京","ローマ"],
["東京","クアラルンプール"],
["東京","メキシコシティ"],
["東京","ヤンゴン"],
["東京","アムステルダム"],
["東京","オークランド"],
["東京","マニラ"],
["東京","ドーハ"],
["東京","モスクワ"],
["東京","シンガポール"],
["東京","マドリード"],
["東京","チューリッヒ"],
["東京","バンコク"],
["東京","ドバイ"],
["東京","アブダビ"],
["東京","ロンドン"],
["東京","アトランタ"],
["東京","ボストン"],
["東京","シカゴ"],
["東京","ダラス"],
["東京","ホノルル"],
["東京","ロサンゼルス"],
["東京","ニューヨーク"],
["東京","サンディエゴ"],
["東京","サンノゼ"],
["東京","サンフランシスコ"],
["東京","シアトル"],
["東京","ヒューストン"],
["東京","ワシントンDC"],
["東京","ホーチミン"],
["東京","ハノイ"],
]
航空乱数=Math.floor(Math.random() * 航空.length);

airfrom=`<font color="springgreen" >${航空[航空乱数][0]}</font>`
airto=`<font color="springgreen" >${航空[航空乱数][1]}</font>`

}