function その他(){

バス=[
["新橋駅","豊洲市場",""],
["渋谷駅","新橋駅",""],
["新宿駅西口","王子駅",""],
["高田馬場駅前","早大正門",""],
["練馬車庫前","新宿駅西口",""],
["浅草寿町","足立梅田町",""],
["浅草雷門","足立区役所",""],
["北千住駅","駒込病院",""],
["門前仲町","東京テレポート駅",""],
["日暮里駅","錦糸町駅",""],
["錦糸町駅","門前仲町",""],
["池袋駅東口","西新井駅",""],
["大塚駅","錦糸町駅",""],
["池袋駅東口","浅草寿町",""],
["東京駅丸の内南口","東京ビッグサイト",""],
["門前仲町","東京ビッグサイト",""],
["早稲田","上野松坂屋",""],
//
["新小岩駅","綾瀬駅",""],
["亀有駅","浅草寿町",""],
["金町駅","三郷中央駅",""],
["小岩駅","金町駅",""],
["金町駅","八潮駅南口",""],
["新小岩駅東北広場","亀有駅",""],
//
["綾瀬駅","花畑団地",""],
["北千住駅","西新井大師",""],
["綾瀬駅","六ツ木都住",""],
["綾瀬駅","竹の塚駅東口",""],
["亀有駅北口","葛飾車庫",""],
["亀有駅北口","亀有駅北口","（西水元循環）"],
["亀有駅北口","亀有駅北口","（佐野・六ツ木循環）"],
["草加駅東口","八潮駅北口",""],
["亀有駅北口","八潮駅南口",""],
//["","",""],
]
バス乱数=Math.floor(Math.random() * バス.length);

バス出発=`<font color="springgreen">${バス[バス乱数][0]}</font>`,
バス到着=`<font color="springgreen">${バス[バス乱数][1]}</font>`,
循環=`<font color="springgreen">${バス[バス乱数][2]}</font>`,

国内線短距離=[
//日本国内線
{from: ["東京",], to:["札幌","釧路","女満別","旭川","帯広","函館","青森","三沢","秋田","山形","富山","小松","大阪","神戸","鳥取","出雲","岡山","広島","徳島","高松","松山","高知","福岡","北九州","佐賀","長崎","熊本","大分","宮崎","鹿児島","奄美大島","那覇","宮古島","石垣島",]},
{from: ["札幌","釧路","女満別","旭川","帯広","函館","青森","三沢","秋田","山形","富山","小松","大阪","神戸","鳥取","出雲","岡山","広島","徳島","高松","松山","高知","福岡","北九州","佐賀","長崎","熊本","大分","宮崎","鹿児島","奄美大島","那覇","宮古島","石垣島",], to : ["東京"]},
]

国内線乱数=Math.floor(Math.random() * 国内線短距離.length);
国内線出発乱数=Math.floor(Math.random() * 国内線短距離[国内線乱数].from.length);
国内線到着乱数=Math.floor(Math.random() * 国内線短距離[国内線乱数].to.length);

国内線出発=`<font color="springgreen">${国内線短距離[国内線乱数].from[国内線出発乱数]}</font>`
国内線到着=`<font color="springgreen">${国内線短距離[国内線乱数].to[国内線到着乱数]}</font>`





}