function その他(){

国内線短距離=[
//日本国内線
{from: ["東京",], to:["札幌","釧路","女満別","旭川","帯広","函館","青森","三沢","秋田","山形","富山","小松","大阪","神戸","鳥取","出雲","岡山","広島","徳島","高松","松山","高知","福岡","北九州","佐賀","長崎","熊本","大分","宮崎","鹿児島","奄美大島","那覇","宮古島","石垣島",]},
{from: ["札幌","釧路","女満別","旭川","帯広","函館","青森","三沢","秋田","山形","富山","小松","大阪","神戸","鳥取","出雲","岡山","広島","徳島","高松","松山","高知","福岡","北九州","佐賀","長崎","熊本","大分","宮崎","鹿児島","奄美大島","那覇","宮古島","石垣島",], to : ["東京"]},
]

国内線乱数=Math.floor(Math.random() * 国内線短距離.length);
国内線出発乱数=Math.floor(Math.random() * 国内線短距離[国内線乱数].from.length);
国内線到着乱数=Math.floor(Math.random() * 国内線短距離[国内線乱数].to.length);

国内線出発=`<font color="springgreen">${国内線短距離[国内線乱数].from[国内線出発乱数]}</font>`
国内線到着=`<font color="springgreen">${国内線短距離[国内線乱数].to[国内線到着乱数]}</font>`





}