function city(){
住居=[
`東京クオリティハウス`,
`デザイナーズハウス`,
`ガラス張りの家`,
`ケビンウェイ邸宅`,
`香港式アパート`,
`日本式アパート`,
`ヤマモモ屋敷`,
`香港式デコマナー`,
`中流式マンション`,
`ニューヨークパレス`,
`高級分譲マンション`,
`赤青マンション`,
`ベッドタウン団地`,
`年代物集合型団地`,
`ツインマンション`,
`超高級マンション`,
`高層マンション`,
`イタリアンマンション`,
]
住居乱数=Math.floor(Math.random() * 住居.length);

公共施設=[
`図書館`,
`サウナ`,
`市民プール`,
`ヨガ公園`,
`小さな公園`,
`小さな遊び場`,
`木のある公園`,
`大きな遊び場`,
`バスケットコート`,
`植物園`,
`BBQピット`,
`テニスコート`,
`バレーコート`,
`スケートボード場`,
`サッカー場`,
`野球場`,
]
公共施設乱数=Math.floor(Math.random() *公共施設.length);

}