function 都市関数(){

都市リスト=[
{name: "北海道", city: ["札幌市","江別市","千歳市","恵庭市","北広島市","石狩市","当別町","新篠津村","岩見沢市","夕張市","美唄市","芦別市","赤平市","三笠市","滝川市","砂川市","歌志内市","深川市","南幌町","奈井江町","上砂川町","由仁町","長沼町","栗山町","月形町","浦臼町","新十津川町","妹背牛町","秩父別町","雨竜町","北竜町","沼田町","小樽市","黒松内町","寿都町","蘭越町","喜茂別町","ニセコ町","留寿都村","倶知安町","京極町","岩内町","神恵内村","泊村","積丹町","古平町","赤井川村","余市町","仁木町","函館市","北斗市","福島町","松前町","木古内町","知内町","七飯町","森町","鹿部町","八雲町","長万部町","厚沢部町","江差町","上ノ国町","乙部町","今金町","せたな町","室蘭市","苫小牧市","登別市","伊達市","洞爺湖町","壮瞥町","豊浦町","白老町","厚真町","安平町","むかわ町","日高町","平取町","新冠町","浦河町","様似町","えりも町","新ひだか町","旭川市","士別市","名寄市","富良野市","鷹栖町","東神楽町","当麻町","比布町","愛別町","上川町","東川町","美瑛町","和寒町","剣淵町","占冠村","美深町","音威子府村","下川町","上富良野町","中富良野町","南富良野町","中川町","幌加内町","留萌市","増毛町","小平町","稚内市","猿払村","枝幸町","浜頓別町","小平町","苫前町","羽幌町","初山別村","天塩町","遠別町","浜頓別町","中頓別町","幌延町","豊富町","北見市","網走市","紋別市","大空町","美幌町","小清水町","斜里町","清里町","佐呂間町","訓子府町","置戸町","遠軽町","湧別町","滝上町","興部町","雄武町","西興部村","帯広市","鹿追町","上士幌町","音更町","士幌町","鹿追町","清水町","新得町","更別村","中札内村","芽室町","広尾町","大樹町","本別町","池田町","幕別町","陸別町","足寄町","浦幌町","釧路市","浜中町","厚岸町","標茶町","弟子屈町","鶴居村","白糠町","根室市","別海町","羅臼町","標津町","中標津町",]},
{name: "青森県", city: ["青森市","弘前市","八戸市","五所川原市","十和田市","三沢市","むつ市","つがる市","今別町","鰺ヶ沢町","大鰐町","野辺地町","七戸町","六戸町","大間町","三戸町","五戸町",]},
{name: "岩手県", city: ["盛岡市","宮古市","大船渡市","花巻市","北上市","久慈市","遠野市","一関市","陸前高田市","釜石市","二戸市","雫石町","九戸村","一戸町",]},
{name: "宮城県", city: ["仙台市","石巻市","気仙沼市","白石市","名取市","多賀城市","岩沼市","登米市","栗原市","東松島市","大崎市","女川町","南三陸町",]},
{name: "秋田県", city: ["秋田市","能代市","横手市","大館市","男鹿市","湯沢市","鹿角市","由利本荘市","にかほ市",]},
{name: "山形県", city: ["山形市","米沢市","鶴岡市","酒田市","新庄市","寒河江市","天童市","東根市",]},
{name: "福島県", city: ["福島市","会津若松市","郡山市","いわき市","白河市","須賀川市","喜多方市","相馬市","二本松市","南会津町","只見町","檜枝岐村",]},
{name: "茨城県", city: ["水戸市","日立市","土浦市","古河市","石岡市","結城市","龍ケ崎市","下妻市","常総市","常陸太田市","高萩市","笠間市","取手市","牛久市","つくば市","ひたちなか市","鹿嶋市","潮来市","守谷市","常陸大宮市","筑西市","坂東市","稲敷市","かすみがうら市","桜川市","神栖市","つくばみらい市","鉾田市","小美玉市","大洗町","阿見町","境町","五霞町",]},
{name: "栃木県", city: ["宇都宮市","足利市","栃木市","佐野市","鹿沼市","日光市","小山市","真岡市","矢板市","那須塩原市","那須烏山市","下野市","上三川町","芳賀町","益子町","茂木町","市貝町","壬生町","高根沢町","那須町",]},
{name: "群馬県", city: ["前橋市","高崎市","桐生市","伊勢崎市","太田市","沼田市","館林市","渋川市","藤岡市","富岡市","安中市","下仁田町","中之条町","長野原町","片品村","川場村","大泉町",]},
{name: "埼玉県", city: ["さいたま市","川越市","熊谷市","川口市","行田市","秩父市","所沢市","飯能市","加須市","本庄市","東松山市","春日部市","狭山市","羽生市","鴻巣市","深谷市","上尾市","草加市","越谷市","蕨市","戸田市","入間市","朝霞市","志木市","和光市","新座市","桶川市","久喜市","北本市","八潮市","富士見市","三郷市","蓮田市","坂戸市","幸手市","鶴ヶ島市","日高市","吉川市","ふじみ野市","白岡市","伊奈町","三芳町","越生町","嵐山町","横瀬町","長瀞町","小鹿野町","松伏町","杉戸町",]},
{name: "千葉県", city: ["千葉市","銚子市","市川市","船橋市","館山市","木更津市","松戸市","野田市","茂原市","成田市","佐倉市","東金市","旭市","習志野市","柏市","勝浦市","市原市","流山市","八千代市","我孫子市","鴨川市","鎌ケ谷市","君津市","富津市","浦安市","四街道市","袖ケ浦市","八街市","印西市","白井市","富里市","南房総市","匝瑳市","香取市","山武市","いすみ市","大網白里市","酒々井町","多古町","神崎町","横芝光町","九十九里町","芝山町","御宿町","大多喜町","鋸南町",]},
{name: "東京都", city: ["千代田区","中央区","港区","新宿区","文京区","台東区","墨田区","江東区","品川区","目黒区","大田区","世田谷区","渋谷区","中野区","杉並区","豊島区","北区","荒川区","板橋区","練馬区","足立区","葛飾区","江戸川区","八王子市","立川市","武蔵野市","三鷹市","青梅市","昭島市","調布市","町田市","小金井市","小平市","日野市","東村山市","国分寺市","国立市","福生市","狛江市","東大和市","清瀬市","東久留米市","武蔵村山市","多摩市","稲城市","羽村市","あきる野市","西東京市","瑞穂町","日の出町","檜原村","奥多摩町",]},
{name: "神奈川県", city: ["横浜市","川崎市","相模原市","横須賀市","平塚市","鎌倉市","藤沢市","小田原市","茅ヶ崎市","逗子市","三浦市","秦野市","厚木市","大和市","伊勢原市","海老名市","座間市","南足柄市","綾瀬市","葉山町","寒川町","大磯町","真鶴町","湯河原町",]},
{name: "新潟県", city: ["新潟市","長岡市","三条市","柏崎市","新発田市","小千谷市","加茂市","十日町市","見附市","村上市","燕市","糸魚川市","妙高市","五泉市","上越市","阿賀野市","魚沼市","南魚沼市","胎内市","聖籠町","佐渡市","弥彦村","阿賀町","出雲崎町","湯沢町",]},
{name: "富山県", city: ["富山市","高岡市","魚津市","氷見市","滑川市","黒部市","砺波市","小矢部市","南砺市","射水市","入善町",]},
{name: "石川県", city: ["金沢市","七尾市","小松市","輪島市","珠洲市","加賀市","羽咋市","かほく市","白山市","穴水町",]},
{name: "福井県", city: ["福井市","敦賀市","小浜市","大野市","勝山市","鯖江市","越前市",]},
{name: "山梨県", city: ["甲府市","富士吉田市","都留市","山梨市","大月市","韮崎市","北杜市","甲斐市","笛吹市","上野原市","甲州市","身延町",]},
{name: "長野県", city: ["長野市","松本市","上田市","岡谷市","飯田市","諏訪市","須坂市","小諸市","伊那市","駒ヶ根市","中野市","大町市","飯山市","茅野市","塩尻市","佐久市","千曲市","東御市","安曇野市","小海町","辰野町","南木曽町","白馬村","小谷村","坂城町","小布施町","木島平村","野沢温泉村",]},
{name: "岐阜県", city: ["岐阜市","大垣市","高山市","多治見市","関市","中津川市","美濃市","瑞浪市","羽島市","恵那市","美濃加茂市","土岐市","各務原市","可児市","飛驒市","本巣市","下呂市","郡上市","海津市","養老町","関ケ原町",]},
{name: "静岡県", city: ["静岡市","浜松市","沼津市","熱海市","三島市","富士宮市","伊東市","島田市","富士市","磐田市","焼津市","掛川市","藤枝市","御殿場市","袋井市","下田市","裾野市","湖西市","伊豆市","御前崎市","伊豆の国市","牧之原市","東伊豆町","南伊豆町","西伊豆町","函南町","長泉町","川根本町",]},
{name: "愛知県", city: ["名古屋市","豊橋市","岡崎市","一宮市","春日井市","豊川市","豊田市","安城市","犬山市","常滑市","小牧市","岩倉市","長久手市","蟹江町","南知多町","設楽町",]},
{name: "三重県", city: ["津市","四日市市","伊勢市","松阪市","桑名市","鈴鹿市","名張市","尾鷲市","亀山市","鳥羽市","熊野市","志摩市","伊賀市","菰野町",]},
{name: "滋賀県", city: ["大津市","彦根市","長浜市","近江八幡市","草津市","守山市","栗東市","甲賀市","野洲市","米原市",]},
{name: "京都府", city: ["京都市","福知山市","舞鶴市","宇治市","亀岡市",]},
{name: "大阪府", city: ["大阪市","堺市","岸和田市","豊中市","吹田市","泉大津市","高槻市","貝塚市","守口市","枚方市","茨木市","八尾市","泉佐野市","富田林市","門真市","東大阪市","泉南市","四條畷市",]},
{name: "兵庫県", city: ["神戸市","姫路市","尼崎市","明石市","西宮市","洲本市","芦屋市","伊丹市","相生市","豊岡市","加古川市","赤穂市","西脇市","宝塚市","三木市","川西市","三田市","香美町","小野市",]},
{name: "奈良県", city: ["奈良市","大和郡山市","橿原市","五條市","生駒市","十津川村",]},
{name: "和歌山県", city: ["和歌山市","橋本市","御坊市","田辺市","新宮市","紀の川市","白浜町","串本町","那智勝浦町",]},
{name: "鳥取県", city: ["鳥取市","米子市","倉吉市","境港市","智頭町",]},
{name: "島根県", city: ["松江市","浜田市","出雲市","益田市",]},
{name: "岡山県", city: ["岡山市","倉敷市","津山市","高梁市","新見市","真庭市",]},
{name: "広島県", city: ["広島市","呉市","竹原市","三原市","尾道市","福山市","三次市","東広島市","廿日市市","江田島市",]},
{name: "山口県", city: ["下関市","宇部市","山口市","萩市","防府市","下松市","岩国市","長門市","周南市",]},
{name: "徳島県", city: ["徳島市","鳴門市","小松島市",]},
{name: "香川県", city: ["高松市","丸亀市","坂出市","善通寺市","観音寺市","三豊市","琴平町",]},
{name: "愛媛県", city: ["松山市","今治市","宇和島市","八幡浜市","新居浜市","四国中央市","大洲市",]},
{name: "高知県", city: ["高知市","室戸市","安芸市","土佐清水市","宿毛市","須崎市","南国市","土佐市",]},
{name: "福岡県", city: ["北九州市","福岡市","大牟田市","久留米市","直方市","飯塚市","行橋市","筑紫野市","大野城市",]},
{name: "佐賀県", city: ["佐賀市","唐津市","鳥栖市","伊万里市","武雄市","嬉野市","有田町",]},
{name: "長崎県", city: ["長崎市","佐世保市","島原市","諫早市","大村市","平戸市","松浦市","雲仙市","南島原市",]},
{name: "熊本県", city: ["熊本市","八代市","人吉市","荒尾市","水俣市","玉名市","山鹿市","宇土市","阿蘇市","大津町",]},
{name: "大分県", city: ["大分市","別府市","中津市","日田市","佐伯市","臼杵市","豊後高田市",]},
{name: "宮崎県", city: ["宮崎市","都城市","延岡市","日南市","日向市",]},
{name: "鹿児島県", city: ["鹿児島市","鹿屋市","枕崎市","阿久根市","出水市","指宿市","垂水市","薩摩川内市","霧島市","志布志市","姶良市",]},
{name: "沖縄県", city: ["那覇市","宜野湾市","浦添市","名護市","糸満市","沖縄市","豊見城市",]},
]

都道府県乱数=Math.floor(Math.random() * 都市リスト.length);
都市乱数=Math.floor(Math.random() * 都市リスト[都道府県乱数].city.length);

自治体=`<font color="springgreen">${都市リスト[都道府県乱数]["name"]}${都市リスト[都道府県乱数].city[都市乱数]}</font>`
地名市=`<font color="springgreen">${都市リスト[都道府県乱数].city[都市乱数]}</font>`
地名=`<font color="springgreen">${都市リスト[都道府県乱数].city[都市乱数].slice(0,-1)}</font>`

}